blog.org
#+STARTUP: overview
#+hugo_base_dir: ./
#+hugo_weight: auto
#+hugo_front_matter_key_replace: description>summary
#+filetags:

** First step towards social media analytics for Science Education Research. :Twitter:Science_Education:Research:
:PROPERTIES:
:EXPORT_FILE_NAME: twitter-api-start
:EXPORT_DATE: 2021-06-24
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :comments true
:END:

#+begin_description
I just delivered my application for Twitter API. A modest research project on the public understanding of science and conversations on scientific topics. Let's see if I get approved. It is a new field of research for me. Looks promising and exciting!
#+end_description

I just delivered my application for Twitter API. A modest research project on the public understanding of science and conversations on scientific topics.

Let's see if I get approved. It is a new field of research for me. Looks promising and exciting!

*** The research project for the application

*The public conversations about Science:* the scientific concept dissemination in and through the social networks.

The research project aims at examines how scientific topics are discussed on social networks, particularly on /Twitter/. I am interested in /Astronomy topics/, such as black holes, eclipses, Mars probe, etc., and politically controversial topics such as /Climate Change/. The data will help better understand how concepts and arguments are formed, developed, and used in people's daily lives. The major goal is to addresses the following question: What are the auxiliary concepts that people use while discussing scientific topics? As it is an exploratory study, there is no clear hypothesis.

The Twitter data will be used to understand and categorize social networks' types of discussions regarding impactful scientific topics. For example, Twitter data can show how people react to scientific news, breakthroughs in Science, and so on.

After collecting a group on tweets of a certain topic in a timeframe (such as 'black hole photography' in 2019), the main treatment is to run a topic analysis with machine learning in =R= and =Python=. I plan to use *Latent Dirichlet Allocation* to collect associated topics or support topics. Finally, some actual reading in a qualitative analysis will be used for validation.

The research will be published in academic papers, mainly in journals of Science Education and Public Understand of Science. In addition, it is likely to be presented in Science Education conferences. The key findings will be reported in an academic blog to help the spread of the academic publications.
